Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Safety Protection Region DLMU Write Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Write Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W_Bits;

/** \brief  CPU Safety Protection Region DLMU Write Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W_Bits;

/** \brief  CPU Safety Protection DLMU Region Lower Address Register */
typedef struct _Ifx_CPU_DLMU_SPROT_RGN_LA_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ADDR:27;               /**< \brief [31:5] Region Lower Address (rw) */
} Ifx_CPU_DLMU_SPROT_RGN_LA_Bits;

/** \brief  CPU Safety protection DLMU Region Upper Address Register */
typedef struct _Ifx_CPU_DLMU_SPROT_RGN_UA_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ADDR:27;               /**< \brief [31:5] Region Upper Address (rw) */
} Ifx_CPU_DLMU_SPROT_RGN_UA_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA0_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA0_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA1_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA1_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA2_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA2_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA3_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA3_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA4_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA4_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA5_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA5_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA6_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA6_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENA7_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_DLMU_SPROT_RGNACCENA7_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB0_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB0_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB1_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB1_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB2_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB2_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB3_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB3_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB4_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB4_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB5_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB5_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB6_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB6_R_Bits;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef struct _Ifx_CPU_DLMU_SPROT_RGNACCENB7_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_DLMU_SPROT_RGNACCENB7_R_Bits;

/** \brief  CPU Debug Monitor Start Address */
typedef struct _Ifx_CPU_DMS_Bits
{
    Ifx_Strict_32Bit reserved_0:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DMSValue:31;           /**< \brief [31:1] Debug Monitor Start Address (rw) */
} Ifx_CPU_DMS_Bits;

/** \brief  CPU Data Protection Range, Lower Bound Register */
typedef struct _Ifx_CPU_DPR_L_Bits
{
    Ifx_Strict_32Bit reserved_0:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LOWBND:29;             /**< \brief [31:3] DPRy Lower Boundary Address (rw) */
} Ifx_CPU_DPR_L_Bits;

/** \brief  CPU Data Protection Range, Upper Bound Register */
typedef struct _Ifx_CPU_DPR_U_Bits
{
    Ifx_Strict_32Bit reserved_0:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit UPPBND:29;             /**< \brief [31:3] DPRy Upper Boundary Address (rw) */
} Ifx_CPU_DPR_U_Bits;

/** \brief  CPU Data Protection Read Enable Register Set 0 */
typedef struct _Ifx_CPU_DPRE_0_Bits
{
    Ifx_Strict_32Bit RE:18;                 /**< \brief [17:0] Read Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPRE_0_Bits;

