Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Data Protection Read Enable Register Set 1 */
typedef struct _Ifx_CPU_DPRE_1_Bits
{
    Ifx_Strict_32Bit RE:18;                 /**< \brief [17:0] Read Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPRE_1_Bits;

/** \brief  CPU Data Protection Read Enable Register Set 2 */
typedef struct _Ifx_CPU_DPRE_2_Bits
{
    Ifx_Strict_32Bit RE:18;                 /**< \brief [17:0] Read Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPRE_2_Bits;

/** \brief  CPU Data Protection Read Enable Register Set 3 */
typedef struct _Ifx_CPU_DPRE_3_Bits
{
    Ifx_Strict_32Bit RE:18;                 /**< \brief [17:0] Read Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPRE_3_Bits;

/** \brief  CPU Data Protection Read Enable Register Set 4 */
typedef struct _Ifx_CPU_DPRE_4_Bits
{
    Ifx_Strict_32Bit RE:18;                 /**< \brief [17:0] Read Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPRE_4_Bits;

/** \brief  CPU Data Protection Read Enable Register Set 5 */
typedef struct _Ifx_CPU_DPRE_5_Bits
{
    Ifx_Strict_32Bit RE:18;                 /**< \brief [17:0] Read Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPRE_5_Bits;

/** \brief  CPU Data Protection Write Enable Register Set 0 */
typedef struct _Ifx_CPU_DPWE_0_Bits
{
    Ifx_Strict_32Bit WE:18;                 /**< \brief [17:0] Write Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPWE_0_Bits;

/** \brief  CPU Data Protection Write Enable Register Set 1 */
typedef struct _Ifx_CPU_DPWE_1_Bits
{
    Ifx_Strict_32Bit WE:18;                 /**< \brief [17:0] Write Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPWE_1_Bits;

/** \brief  CPU Data Protection Write Enable Register Set 2 */
typedef struct _Ifx_CPU_DPWE_2_Bits
{
    Ifx_Strict_32Bit WE:18;                 /**< \brief [17:0] Write Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPWE_2_Bits;

/** \brief  CPU Data Protection Write Enable Register Set 3 */
typedef struct _Ifx_CPU_DPWE_3_Bits
{
    Ifx_Strict_32Bit WE:18;                 /**< \brief [17:0] Write Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPWE_3_Bits;

/** \brief  CPU Data Protection Write Enable Register Set 4 */
typedef struct _Ifx_CPU_DPWE_4_Bits
{
    Ifx_Strict_32Bit WE:18;                 /**< \brief [17:0] Write Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPWE_4_Bits;

/** \brief  CPU Data Protection Write Enable Register Set 5 */
typedef struct _Ifx_CPU_DPWE_5_Bits
{
    Ifx_Strict_32Bit WE:18;                 /**< \brief [17:0] Write Enable Range Select (rw) */
    Ifx_Strict_32Bit reserved_18:14;        /**< \brief \internal Reserved */
} Ifx_CPU_DPWE_5_Bits;

/** \brief  CPU Data Synchronous Trap Register */
typedef struct _Ifx_CPU_DSTR_Bits
{
    Ifx_Strict_32Bit SRE:1;                 /**< \brief [0:0] Scratch Range Error (rwh) */
    Ifx_Strict_32Bit GAE:1;                 /**< \brief [1:1] Global Address Error (rwh) */
    Ifx_Strict_32Bit LBE:1;                 /**< \brief [2:2] Load Bus Error (rwh) */
    Ifx_Strict_32Bit reserved_3:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CRE:1;                 /**< \brief [6:6] Cache Refill Error (rwh) */
    Ifx_Strict_32Bit reserved_7:7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DTME:1;                /**< \brief [14:14] DTAG MSIST Error (rwh) */
    Ifx_Strict_32Bit LOE:1;                 /**< \brief [15:15] Load Overlay Error (rwh) */
    Ifx_Strict_32Bit SDE:1;                 /**< \brief [16:16] Segment Difference Error (rwh) */
    Ifx_Strict_32Bit SCE:1;                 /**< \brief [17:17] Segment Crossing Error (rwh) */
    Ifx_Strict_32Bit CAC:1;                 /**< \brief [18:18] CSFR Access Error (rwh) */
    Ifx_Strict_32Bit MPE:1;                 /**< \brief [19:19] Memory Protection Error (rwh) */
    Ifx_Strict_32Bit CLE:1;                 /**< \brief [20:20] Context Location Error (rwh) */
    Ifx_Strict_32Bit reserved_21:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ALN:1;                 /**< \brief [24:24] Alignment Error (rwh) */
    Ifx_Strict_32Bit reserved_25:7;         /**< \brief \internal Reserved */
} Ifx_CPU_DSTR_Bits;

/** \brief  CPU External Event Register */
typedef struct _Ifx_CPU_EXEVT_Bits
{
    Ifx_Strict_32Bit EVTA:3;                /**< \brief [2:0] Event Associated (rw) */
    Ifx_Strict_32Bit BBM:1;                 /**< \brief [3:3] Break Before Make (BBM) or Break After Make (BAM) Selection (rw) */
    Ifx_Strict_32Bit BOD:1;                 /**< \brief [4:4] Breakout Disable (rw) */
    Ifx_Strict_32Bit SUSP:1;                /**< \brief [5:5] CDC Suspend-Out Signal State (rw) */
    Ifx_Strict_32Bit CNT:2;                 /**< \brief [7:6] Counter (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CPU_EXEVT_Bits;

/** \brief  CPU Free CSA List Head Pointer */
typedef struct _Ifx_CPU_FCX_Bits
{
    Ifx_Strict_32Bit FCXO:16;               /**< \brief [15:0] FCX Offset Address Field (rw) */
    Ifx_Strict_32Bit FCXS:4;                /**< \brief [19:16] FCX Segment Address Field (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CPU_FCX_Bits;

/** \brief  CPU Flash Configuration Register 0 */
typedef struct _Ifx_CPU_FLASHCON0_Bits
{
    Ifx_Strict_32Bit TAG1:6;                /**< \brief [5:0] Flash Prefetch Buffer 1 Configuration (rw) */
    Ifx_Strict_32Bit reserved_6:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TAG2:6;                /**< \brief [13:8] Flash Prefetch Buffer 2 Configuration (rw) */
    Ifx_Strict_32Bit reserved_14:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TAG3:6;                /**< \brief [21:16] Flash Prefetch Buffer 3 Configuration (rw) */
    Ifx_Strict_32Bit reserved_22:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TAG4:6;                /**< \brief [29:24] Flash Prefetch Buffer 4 Configuration (rw) */
    Ifx_Strict_32Bit reserved_30:2;         /**< \brief \internal Reserved */
} Ifx_CPU_FLASHCON0_Bits;

