Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Overlay Mask Register 28 */
typedef struct _Ifx_CPU_OMASK28_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK28_Bits;

/** \brief  CPU Overlay Mask Register 29 */
typedef struct _Ifx_CPU_OMASK29_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK29_Bits;

/** \brief  CPU Overlay Mask Register 2 */
typedef struct _Ifx_CPU_OMASK2_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK2_Bits;

/** \brief  CPU Overlay Mask Register 30 */
typedef struct _Ifx_CPU_OMASK30_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK30_Bits;

/** \brief  CPU Overlay Mask Register 31 */
typedef struct _Ifx_CPU_OMASK31_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK31_Bits;

/** \brief  CPU Overlay Mask Register 3 */
typedef struct _Ifx_CPU_OMASK3_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK3_Bits;

/** \brief  CPU Overlay Mask Register 4 */
typedef struct _Ifx_CPU_OMASK4_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK4_Bits;

/** \brief  CPU Overlay Mask Register 5 */
typedef struct _Ifx_CPU_OMASK5_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK5_Bits;

/** \brief  CPU Overlay Mask Register 6 */
typedef struct _Ifx_CPU_OMASK6_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK6_Bits;

/** \brief  CPU Overlay Mask Register 7 */
typedef struct _Ifx_CPU_OMASK7_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK7_Bits;

/** \brief  CPU Overlay Mask Register 8 */
typedef struct _Ifx_CPU_OMASK8_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK8_Bits;

/** \brief  CPU Overlay Mask Register 9 */
typedef struct _Ifx_CPU_OMASK9_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMASK:12;              /**< \brief [16:5] Overlay Address Mask (rw) */
    Ifx_Strict_32Bit ONE:11;                /**< \brief [27:17] Fixed "1" Values (r) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_CPU_OMASK9_Bits;

/** \brief  CPU Overlay Range Select Register */
typedef struct _Ifx_CPU_OSEL_Bits
{
    Ifx_Strict_32Bit SHOVEN0:1;             /**< \brief [0:0] Shadow Overlay Enable 0 (rw) */
    Ifx_Strict_32Bit SHOVEN1:1;             /**< \brief [1:1] Shadow Overlay Enable 1 (rw) */
    Ifx_Strict_32Bit SHOVEN2:1;             /**< \brief [2:2] Shadow Overlay Enable 2 (rw) */
    Ifx_Strict_32Bit SHOVEN3:1;             /**< \brief [3:3] Shadow Overlay Enable 3 (rw) */
    Ifx_Strict_32Bit SHOVEN4:1;             /**< \brief [4:4] Shadow Overlay Enable 4 (rw) */
    Ifx_Strict_32Bit SHOVEN5:1;             /**< \brief [5:5] Shadow Overlay Enable 5 (rw) */
    Ifx_Strict_32Bit SHOVEN6:1;             /**< \brief [6:6] Shadow Overlay Enable 6 (rw) */
    Ifx_Strict_32Bit SHOVEN7:1;             /**< \brief [7:7] Shadow Overlay Enable 7 (rw) */
    Ifx_Strict_32Bit SHOVEN8:1;             /**< \brief [8:8] Shadow Overlay Enable 8 (rw) */
    Ifx_Strict_32Bit SHOVEN9:1;             /**< \brief [9:9] Shadow Overlay Enable 9 (rw) */
    Ifx_Strict_32Bit SHOVEN10:1;            /**< \brief [10:10] Shadow Overlay Enable 10 (rw) */
    Ifx_Strict_32Bit SHOVEN11:1;            /**< \brief [11:11] Shadow Overlay Enable 11 (rw) */
    Ifx_Strict_32Bit SHOVEN12:1;            /**< \brief [12:12] Shadow Overlay Enable 12 (rw) */
    Ifx_Strict_32Bit SHOVEN13:1;            /**< \brief [13:13] Shadow Overlay Enable 13 (rw) */
    Ifx_Strict_32Bit SHOVEN14:1;            /**< \brief [14:14] Shadow Overlay Enable 14 (rw) */
    Ifx_Strict_32Bit SHOVEN15:1;            /**< \brief [15:15] Shadow Overlay Enable 15 (rw) */
    Ifx_Strict_32Bit SHOVEN16:1;            /**< \brief [16:16] Shadow Overlay Enable 16 (rw) */
    Ifx_Strict_32Bit SHOVEN17:1;            /**< \brief [17:17] Shadow Overlay Enable 17 (rw) */
    Ifx_Strict_32Bit SHOVEN18:1;            /**< \brief [18:18] Shadow Overlay Enable 18 (rw) */
    Ifx_Strict_32Bit SHOVEN19:1;            /**< \brief [19:19] Shadow Overlay Enable 19 (rw) */
    Ifx_Strict_32Bit SHOVEN20:1;            /**< \brief [20:20] Shadow Overlay Enable 20 (rw) */
    Ifx_Strict_32Bit SHOVEN21:1;            /**< \brief [21:21] Shadow Overlay Enable 21 (rw) */
    Ifx_Strict_32Bit SHOVEN22:1;            /**< \brief [22:22] Shadow Overlay Enable 22 (rw) */
    Ifx_Strict_32Bit SHOVEN23:1;            /**< \brief [23:23] Shadow Overlay Enable 23 (rw) */
    Ifx_Strict_32Bit SHOVEN24:1;            /**< \brief [24:24] Shadow Overlay Enable 24 (rw) */
    Ifx_Strict_32Bit SHOVEN25:1;            /**< \brief [25:25] Shadow Overlay Enable 25 (rw) */
    Ifx_Strict_32Bit SHOVEN26:1;            /**< \brief [26:26] Shadow Overlay Enable 26 (rw) */
    Ifx_Strict_32Bit SHOVEN27:1;            /**< \brief [27:27] Shadow Overlay Enable 27 (rw) */
    Ifx_Strict_32Bit SHOVEN28:1;            /**< \brief [28:28] Shadow Overlay Enable 28 (rw) */
    Ifx_Strict_32Bit SHOVEN29:1;            /**< \brief [29:29] Shadow Overlay Enable 29 (rw) */
    Ifx_Strict_32Bit SHOVEN30:1;            /**< \brief [30:30] Shadow Overlay Enable 30 (rw) */
    Ifx_Strict_32Bit SHOVEN31:1;            /**< \brief [31:31] Shadow Overlay Enable 31 (rw) */
} Ifx_CPU_OSEL_Bits;

