Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Redirected Address Base Register 9 */
typedef struct _Ifx_CPU_RABR9_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OBASE:17;              /**< \brief [21:5] Overlay Block Base Address (rw) */
    Ifx_Strict_32Bit reserved_22:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OMEM:4;                /**< \brief [27:24] Overlay Memory Select (rw) */
    Ifx_Strict_32Bit reserved_28:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OVEN:1;                /**< \brief [31:31] Overlay Enabled (rwh) */
} Ifx_CPU_RABR9_Bits;

/** \brief  CPU SRI Error Generation Register */
typedef struct _Ifx_CPU_SEGEN_Bits
{
    Ifx_Strict_32Bit ADFLIP:8;              /**< \brief [7:0] Address ECC Bit Flip (rw) */
    Ifx_Strict_32Bit ADTYPE:2;              /**< \brief [9:8] Type of error (rw) */
    Ifx_Strict_32Bit reserved_10:21;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AE:1;                  /**< \brief [31:31] Activate Error Enable (rwh) */
} Ifx_CPU_SEGEN_Bits;

/** \brief  CPU Safety Protection Register Access Enable Register A */
typedef struct _Ifx_CPU_SFR_SPROT_ACCENA_W_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Access Enable for Master TAG ID n (n= 0-31) (rw) */
} Ifx_CPU_SFR_SPROT_ACCENA_W_Bits;

/** \brief  CPU Safety Protection Region Access Enable Register B */
typedef struct _Ifx_CPU_SFR_SPROT_ACCENB_W_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SFR_SPROT_ACCENB_W_Bits;

/** \brief  CPU SIST Mode Access Control Register */
typedef struct _Ifx_CPU_SMACON_Bits
{
    Ifx_Strict_32Bit reserved_0:24;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IODT:1;                /**< \brief [24:24] In-Order Data Transactions (rw) */
    Ifx_Strict_32Bit reserved_25:7;         /**< \brief \internal Reserved */
} Ifx_CPU_SMACON_Bits;

/** \brief  CPU Safety Protection Region SPR Write Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGN_ACCENA_W_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Write Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGN_ACCENA_W_Bits;

/** \brief  CPU Safety Protection Region SPR Write Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGN_ACCENB_W_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGN_ACCENB_W_Bits;

/** \brief  CPU Safety Protection SPR Region Lower Address Register */
typedef struct _Ifx_CPU_SPR_SPROT_RGN_LA_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ADDR:27;               /**< \brief [31:5] Region Lower Address (rw) */
} Ifx_CPU_SPR_SPROT_RGN_LA_Bits;

/** \brief  CPU Safety protection SPR Region Upper Address Register */
typedef struct _Ifx_CPU_SPR_SPROT_RGN_UA_Bits
{
    Ifx_Strict_32Bit reserved_0:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ADDR:27;               /**< \brief [31:5] Region Upper Address (rw) */
} Ifx_CPU_SPR_SPROT_RGN_UA_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA0_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA0_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA1_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA1_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA2_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA2_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA3_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA3_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA4_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA4_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA5_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA5_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA6_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA6_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENA7_R_Bits
{
    Ifx_Strict_32Bit EN:32;                 /**< \brief [31:0] Read Access Enable for Master TAG ID n (n=0-31) (rw) */
} Ifx_CPU_SPR_SPROT_RGNACCENA7_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB0_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB0_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB1_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB1_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB2_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB2_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB3_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB3_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB4_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB4_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB5_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB5_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB6_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB6_R_Bits;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef struct _Ifx_CPU_SPR_SPROT_RGNACCENB7_R_Bits
{
    Ifx_Strict_32Bit reserved_0:32;         /**< \brief \internal Reserved */
} Ifx_CPU_SPR_SPROT_RGNACCENB7_R_Bits;

/** \brief  CPU Software Debug Event */
typedef struct _Ifx_CPU_SWEVT_Bits
{
    Ifx_Strict_32Bit EVTA:3;                /**< \brief [2:0] Event Associated (rw) */
    Ifx_Strict_32Bit BBM:1;                 /**< \brief [3:3] Break Before Make (BBM) or Break After Make (BAM) Selection (rw) */
    Ifx_Strict_32Bit BOD:1;                 /**< \brief [4:4] Breakout Disable (rw) */
    Ifx_Strict_32Bit SUSP:1;                /**< \brief [5:5] CDC Suspend-Out Signal State (rw) */
    Ifx_Strict_32Bit CNT:2;                 /**< \brief [7:6] Counter (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CPU_SWEVT_Bits;

/** \brief  CPU System Configuration Register */
typedef struct _Ifx_CPU_SYSCON_Bits
{
    Ifx_Strict_32Bit FCDSF:1;               /**< \brief [0:0] Free Context List Depleted Sticky Flag (rwh) */
    Ifx_Strict_32Bit PROTEN:1;              /**< \brief [1:1] Memory Protection Enable (rw) */
    Ifx_Strict_32Bit TPROTEN:1;             /**< \brief [2:2] Temporal Protection Enable (rw) */
    Ifx_Strict_32Bit IS:1;                  /**< \brief [3:3] Initial State (rw) */
    Ifx_Strict_32Bit IT:1;                  /**< \brief [4:4] Initial State (rw) */
    Ifx_Strict_32Bit reserved_5:19;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BHALT:1;               /**< \brief [24:24] Boot Halt (rw) */
    Ifx_Strict_32Bit reserved_25:7;         /**< \brief \internal Reserved */
} Ifx_CPU_SYSCON_Bits;

