Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Identification Register TC1.6P */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPU_ID_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPU_ID;

/** \brief  CPU Code Protection Execute Enable Register Set 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPXE_0_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPXE_0;

/** \brief  CPU Code Protection Execute Enable Register Set 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPXE_1_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPXE_1;

/** \brief  CPU Code Protection Execute Enable Register Set 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPXE_2_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPXE_2;

/** \brief  CPU Code Protection Execute Enable Register Set 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPXE_3_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPXE_3;

/** \brief  CPU Code Protection Execute Enable Register Set 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPXE_4_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPXE_4;

/** \brief  CPU Code Protection Execute Enable Register Set 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CPXE_5_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CPXE_5;

/** \brief  CPU Core Register Access Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CREVT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_CREVT;

/** \brief  CPU Customer ID register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_CUS_ID_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_CUS_ID;

/** \brief  CPU Data General Purpose Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_D_Bits B;                       /**< \brief Bitfield access */
} Ifx_CPU_D;

/** \brief  CPU Data Asynchronous Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DATR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_DATR;

/** \brief  CPU Debug Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DBGSR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DBGSR;

/** \brief  CPU Debug Trap Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DBGTCR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DBGTCR;

/** \brief  CPU Data Memory Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DCON0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DCON0;

/** \brief  CPU Data Control Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DCON2_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DCON2;

/** \brief  CPU Debug Context Save Area Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DCX_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_DCX;

/** \brief  CPU Data Error Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DEADD_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DEADD;

/** \brief  CPU Data Integrity Error Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DIEAR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DIEAR;

/** \brief  CPU Data Integrity Error Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DIETR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DIETR;

/** \brief  CPU Safety Protection Region DLMU Write Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W;

/** \brief  CPU Safety Protection Region DLMU Write Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W;

/** \brief  CPU Safety Protection DLMU Region Lower Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGN_LA_Bits B;       /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGN_LA;

/** \brief  CPU Safety protection DLMU Region Upper Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGN_UA_Bits B;       /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGN_UA;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA0_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA0_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA1_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA1_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA2_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA2_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA3_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA3_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA4_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA4_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA5_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA5_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA6_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA6_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENA7_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENA7_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB0_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB0_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB1_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB1_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB2_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB2_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB3_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB3_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB4_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB4_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB5_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB5_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB6_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB6_R;

/** \brief  CPU Safety Protection Region DLMU Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DLMU_SPROT_RGNACCENB7_R_Bits B; /**< \brief Bitfield access */
} Ifx_CPU_DLMU_SPROT_RGNACCENB7_R;

/** \brief  CPU Debug Monitor Start Address */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DMS_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_DMS;

/** \brief  CPU Data Protection Range, Lower Bound Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPR_L_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DPR_L;

/** \brief  CPU Data Protection Range, Upper Bound Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPR_U_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_DPR_U;

/** \brief  CPU Data Protection Read Enable Register Set 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPRE_0_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPRE_0;

