Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Data Protection Read Enable Register Set 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPRE_1_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPRE_1;

/** \brief  CPU Data Protection Read Enable Register Set 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPRE_2_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPRE_2;

/** \brief  CPU Data Protection Read Enable Register Set 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPRE_3_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPRE_3;

/** \brief  CPU Data Protection Read Enable Register Set 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPRE_4_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPRE_4;

/** \brief  CPU Data Protection Read Enable Register Set 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPRE_5_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPRE_5;

/** \brief  CPU Data Protection Write Enable Register Set 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPWE_0_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPWE_0;

/** \brief  CPU Data Protection Write Enable Register Set 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPWE_1_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPWE_1;

/** \brief  CPU Data Protection Write Enable Register Set 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPWE_2_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPWE_2;

/** \brief  CPU Data Protection Write Enable Register Set 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPWE_3_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPWE_3;

/** \brief  CPU Data Protection Write Enable Register Set 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPWE_4_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPWE_4;

/** \brief  CPU Data Protection Write Enable Register Set 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DPWE_5_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_DPWE_5;

/** \brief  CPU Data Synchronous Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_DSTR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_DSTR;

/** \brief  CPU External Event Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_EXEVT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_EXEVT;

/** \brief  CPU Free CSA List Head Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FCX_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_FCX;

/** \brief  CPU Flash Configuration Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FLASHCON0_Bits B;               /**< \brief Bitfield access */
} Ifx_CPU_FLASHCON0;

/** \brief  CPU Flash Configuration Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FLASHCON1_Bits B;               /**< \brief Bitfield access */
} Ifx_CPU_FLASHCON1;

/** \brief  CPU Flash Configuration Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FLASHCON2_Bits B;               /**< \brief Bitfield access */
} Ifx_CPU_FLASHCON2;

/** \brief  CPU Flash Configuration Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FLASHCON3_Bits B;               /**< \brief Bitfield access */
} Ifx_CPU_FLASHCON3;

/** \brief  CPU Trap Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_CON_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_CON;

/** \brief  CPU Trapping Instruction Opcode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_OPC_Bits B;            /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_OPC;

/** \brief  CPU Trapping Instruction Program Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_PC_Bits B;             /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_PC;

