Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Trapping Instruction Operand Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_SRC1_Bits B;           /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_SRC1;

/** \brief  CPU Trapping Instruction Operand Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_SRC2_Bits B;           /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_SRC2;

/** \brief  CPU Trapping Instruction Operand Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_FPU_TRAP_SRC3_Bits B;           /**< \brief Bitfield access */
} Ifx_CPU_FPU_TRAP_SRC3;

/** \brief  CPU Instruction Count */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_ICNT_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_ICNT;

/** \brief  CPU Interrupt Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_ICR_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_ICR;

/** \brief  CPU Interrupt Stack Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_ISP_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_ISP;

/** \brief  CPU Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_KRST0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_KRST0;

/** \brief  CPU Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_KRST1_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_KRST1;

/** \brief  CPU Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_KRSTCLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_KRSTCLR;

/** \brief  CPU Free CSA List Limit Pointer */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_LCX_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_LCX;

/** \brief  CPU Safety Protection Region LPB Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_LPB_SPROT_ACCENA_R_Bits B;      /**< \brief Bitfield access */
} Ifx_CPU_LPB_SPROT_ACCENA_R;

/** \brief  CPU Safety Protection Region LPB Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_LPB_SPROT_ACCENB_R_Bits B;      /**< \brief Bitfield access */
} Ifx_CPU_LPB_SPROT_ACCENB_R;

/** \brief  CPU Multi-Count Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_M1CNT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_M1CNT;

/** \brief  CPU Multi-Count Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_M2CNT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_M2CNT;

/** \brief  CPU Multi-Count Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_M3CNT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_M3CNT;

/** \brief  CPU Overlay Mask Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK0_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK0;

/** \brief  CPU Overlay Mask Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK1_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK1;

/** \brief  CPU Overlay Mask Register 10 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK10_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK10;

/** \brief  CPU Overlay Mask Register 11 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK11_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK11;

/** \brief  CPU Overlay Mask Register 12 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK12_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK12;

/** \brief  CPU Overlay Mask Register 13 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK13_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK13;

