Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Overlay Mask Register 14 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK14_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK14;

/** \brief  CPU Overlay Mask Register 15 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK15_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK15;

/** \brief  CPU Overlay Mask Register 16 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK16_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK16;

/** \brief  CPU Overlay Mask Register 17 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK17_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK17;

/** \brief  CPU Overlay Mask Register 18 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK18_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK18;

/** \brief  CPU Overlay Mask Register 19 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK19_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK19;

/** \brief  CPU Overlay Mask Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK2_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK2;

/** \brief  CPU Overlay Mask Register 20 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK20_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK20;

/** \brief  CPU Overlay Mask Register 21 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK21_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK21;

/** \brief  CPU Overlay Mask Register 22 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK22_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK22;

/** \brief  CPU Overlay Mask Register 23 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK23_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK23;

/** \brief  CPU Overlay Mask Register 24 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK24_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK24;

/** \brief  CPU Overlay Mask Register 25 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK25_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK25;

/** \brief  CPU Overlay Mask Register 26 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK26_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK26;

/** \brief  CPU Overlay Mask Register 27 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK27_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK27;

/** \brief  CPU Overlay Mask Register 28 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK28_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK28;

/** \brief  CPU Overlay Mask Register 29 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK29_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK29;

/** \brief  CPU Overlay Mask Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK3_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK3;

/** \brief  CPU Overlay Mask Register 30 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK30_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK30;

/** \brief  CPU Overlay Mask Register 31 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK31_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_OMASK31;

/** \brief  CPU Overlay Mask Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK4_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK4;

/** \brief  CPU Overlay Mask Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK5_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK5;

/** \brief  CPU Overlay Mask Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK6_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK6;

