Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Overlay Mask Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK7_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK7;

/** \brief  CPU Overlay Mask Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK8_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK8;

/** \brief  CPU Overlay Mask Register 9 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OMASK9_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OMASK9;

/** \brief  CPU Overlay Range Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OSEL_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_OSEL;

/** \brief  CPU Overlay Target Address Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR0;

/** \brief  CPU Overlay Target Address Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR1_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR1;

/** \brief  CPU Overlay Target Address Register 10 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR10_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR10;

/** \brief  CPU Overlay Target Address Register 11 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR11_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR11;

/** \brief  CPU Overlay Target Address Register 12 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR12_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR12;

/** \brief  CPU Overlay Target Address Register 13 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR13_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR13;

/** \brief  CPU Overlay Target Address Register 14 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR14_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR14;

/** \brief  CPU Overlay Target Address Register 15 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR15_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR15;

/** \brief  CPU Overlay Target Address Register 16 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR16_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR16;

/** \brief  CPU Overlay Target Address Register 17 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR17_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR17;

/** \brief  CPU Overlay Target Address Register 18 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR18_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR18;

/** \brief  CPU Overlay Target Address Register 19 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR19_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR19;

/** \brief  CPU Overlay Target Address Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR2_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR2;

/** \brief  CPU Overlay Target Address Register 20 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR20_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR20;

/** \brief  CPU Overlay Target Address Register 21 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR21_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR21;

/** \brief  CPU Overlay Target Address Register 22 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR22_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR22;

/** \brief  CPU Overlay Target Address Register 23 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR23_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR23;

/** \brief  CPU Overlay Target Address Register 24 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR24_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR24;

/** \brief  CPU Overlay Target Address Register 25 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR25_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR25;

/** \brief  CPU Overlay Target Address Register 26 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR26_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR26;

