Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Overlay Target Address Register 27 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR27_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR27;

/** \brief  CPU Overlay Target Address Register 28 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR28_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR28;

/** \brief  CPU Overlay Target Address Register 29 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR29_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR29;

/** \brief  CPU Overlay Target Address Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR3_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR3;

/** \brief  CPU Overlay Target Address Register 30 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR30_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR30;

/** \brief  CPU Overlay Target Address Register 31 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR31_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_OTAR31;

/** \brief  CPU Overlay Target Address Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR4_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR4;

/** \brief  CPU Overlay Target Address Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR5_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR5;

/** \brief  CPU Overlay Target Address Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR6_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR6;

/** \brief  CPU Overlay Target Address Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR7_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR7;

/** \brief  CPU Overlay Target Address Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR8_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR8;

/** \brief  CPU Overlay Target Address Register 9 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_OTAR9_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_OTAR9;

/** \brief  CPU Program Counter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PC_Bits B;                      /**< \brief Bitfield access */
} Ifx_CPU_PC;

/** \brief  CPU Program Control 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCON0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PCON0;

/** \brief  CPU Program Control 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCON1_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PCON1;

/** \brief  CPU Program Control 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCON2_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PCON2;

/** \brief  CPU Previous Context Information Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PCXI_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PCXI;

/** \brief  CPU Program Integrity Error Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PIEAR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PIEAR;

/** \brief  CPU Program Integrity Error Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PIETR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_PIETR;

/** \brief  CPU Data Access CacheabilityRegister */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PMA0_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PMA0;

/** \brief  CPU Code Access CacheabilityRegister */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PMA1_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PMA1;

/** \brief  CPU Peripheral Space Identifier register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PMA2_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PMA2;

/** \brief  CPU Program Synchronous Trap Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PSTR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CPU_PSTR;

/** \brief  CPU Program Status Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_PSW_Bits B;                     /**< \brief Bitfield access */
} Ifx_CPU_PSW;

/** \brief  CPU Redirected Address Base Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR0_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR0;

/** \brief  CPU Redirected Address Base Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR1_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR1;

