Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Redirected Address Base Register 10 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR10_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR10;

/** \brief  CPU Redirected Address Base Register 11 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR11_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR11;

/** \brief  CPU Redirected Address Base Register 12 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR12_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR12;

/** \brief  CPU Redirected Address Base Register 13 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR13_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR13;

/** \brief  CPU Redirected Address Base Register 14 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR14_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR14;

/** \brief  CPU Redirected Address Base Register 15 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR15_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR15;

/** \brief  CPU Redirected Address Base Register 16 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR16_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR16;

/** \brief  CPU Redirected Address Base Register 17 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR17_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR17;

/** \brief  CPU Redirected Address Base Register 18 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR18_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR18;

/** \brief  CPU Redirected Address Base Register 19 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR19_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR19;

/** \brief  CPU Redirected Address Base Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR2_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR2;

/** \brief  CPU Redirected Address Base Register 20 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR20_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR20;

/** \brief  CPU Redirected Address Base Register 21 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR21_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR21;

/** \brief  CPU Redirected Address Base Register 22 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR22_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR22;

/** \brief  CPU Redirected Address Base Register 23 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR23_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR23;

/** \brief  CPU Redirected Address Base Register 24 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR24_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR24;

/** \brief  CPU Redirected Address Base Register 25 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR25_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR25;

/** \brief  CPU Redirected Address Base Register 26 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR26_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR26;

/** \brief  CPU Redirected Address Base Register 27 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR27_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR27;

/** \brief  CPU Redirected Address Base Register 28 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR28_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR28;

/** \brief  CPU Redirected Address Base Register 29 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR29_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR29;

