Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Redirected Address Base Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR3_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR3;

/** \brief  CPU Redirected Address Base Register 30 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR30_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR30;

/** \brief  CPU Redirected Address Base Register 31 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR31_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_RABR31;

/** \brief  CPU Redirected Address Base Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR4_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR4;

/** \brief  CPU Redirected Address Base Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR5_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR5;

/** \brief  CPU Redirected Address Base Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR6_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR6;

/** \brief  CPU Redirected Address Base Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR7_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR7;

/** \brief  CPU Redirected Address Base Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR8_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR8;

/** \brief  CPU Redirected Address Base Register 9 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_RABR9_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_RABR9;

/** \brief  CPU SRI Error Generation Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SEGEN_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_SEGEN;

/** \brief  CPU Safety Protection Register Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SFR_SPROT_ACCENA_W_Bits B;      /**< \brief Bitfield access */
} Ifx_CPU_SFR_SPROT_ACCENA_W;

/** \brief  CPU Safety Protection Region Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SFR_SPROT_ACCENB_W_Bits B;      /**< \brief Bitfield access */
} Ifx_CPU_SFR_SPROT_ACCENB_W;

/** \brief  CPU SIST Mode Access Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SMACON_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_SMACON;

/** \brief  CPU Safety Protection Region SPR Write Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGN_ACCENA_W_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGN_ACCENA_W;

/** \brief  CPU Safety Protection Region SPR Write Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGN_ACCENB_W_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGN_ACCENB_W;

/** \brief  CPU Safety Protection SPR Region Lower Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGN_LA_Bits B;        /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGN_LA;

/** \brief  CPU Safety protection SPR Region Upper Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGN_UA_Bits B;        /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGN_UA;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA0_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA0_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA1_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA1_R;

