Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA2_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA2_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA3_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA3_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA4_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA4_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA5_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA5_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA6_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA6_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENA7_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENA7_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB0_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB0_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB1_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB1_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB2_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB2_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB3_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB3_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB4_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB4_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB5_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB5_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB6_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB6_R;

/** \brief  CPU Safety Protection Region SPR Read Access Enable Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SPR_SPROT_RGNACCENB7_R_Bits B;  /**< \brief Bitfield access */
} Ifx_CPU_SPR_SPROT_RGNACCENB7_R;

/** \brief  CPU Software Debug Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SWEVT_Bits B;                   /**< \brief Bitfield access */
} Ifx_CPU_SWEVT;

/** \brief  CPU System Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_SYSCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_SYSCON;

/** \brief  CPU Task Address Space Identifier Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TASK_ASI_Bits B;                /**< \brief Bitfield access */
} Ifx_CPU_TASK_ASI;

/** \brief  CPU Temporal Protection System Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_CON_Bits B;                 /**< \brief Bitfield access */
} Ifx_CPU_TPS_CON;

/** \brief  CPU Exception Timer Class Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_EXTIM_CLASS_EN_Bits B;      /**< \brief Bitfield access */
} Ifx_CPU_TPS_EXTIM_CLASS_EN;

