Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  CPU Exception Timer Current Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_EXTIM_CVAL_Bits B;          /**< \brief Bitfield access */
} Ifx_CPU_TPS_EXTIM_CVAL;

/** \brief  CPU Exception Timer Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_EXTIM_FCX_Bits B;           /**< \brief Bitfield access */
} Ifx_CPU_TPS_EXTIM_FCX;

/** \brief  CPU Exception Timer Load Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_EXTIM_LVAL_Bits B;          /**< \brief Bitfield access */
} Ifx_CPU_TPS_EXTIM_LVAL;

/** \brief  CPU Exception Timer Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_EXTIM_STAT_Bits B;          /**< \brief Bitfield access */
} Ifx_CPU_TPS_EXTIM_STAT;

/** \brief  CPU Temporal Protection System Timer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TPS_TIMER_Bits B;               /**< \brief Bitfield access */
} Ifx_CPU_TPS_TIMER;

/** \brief  CPU Trigger Address */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TR_ADR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_TR_ADR;

/** \brief  CPU Trigger Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TR_EVT_Bits B;                  /**< \brief Bitfield access */
} Ifx_CPU_TR_EVT;

/** \brief  CPU Trigger Address x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CPU_TRIG_ACC_Bits B;                /**< \brief Bitfield access */
} Ifx_CPU_TRIG_ACC;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \brief  Safety protection region */
typedef volatile struct _Ifx_CPU_DLMU_SPROT_RGN
{
    Ifx_CPU_DLMU_SPROT_RGN_LA LA;           /**< \brief 0, CPU Safety Protection DLMU Region Lower Address Register */
    Ifx_CPU_DLMU_SPROT_RGN_UA UA;           /**< \brief 4, CPU Safety protection DLMU Region Upper Address Register */
    Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W ACCENA_W;   /**< \brief 8, CPU Safety Protection Region DLMU Write Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W ACCENB_W;   /**< \brief C, CPU Safety Protection Region DLMU Write Access Enable Register B */
} Ifx_CPU_DLMU_SPROT_RGN;

/** \brief  Safety protection region */
typedef volatile struct _Ifx_CPU_SPR_SPROT_RGN
{
    Ifx_CPU_SPR_SPROT_RGN_LA LA;            /**< \brief 0, CPU Safety Protection SPR Region Lower Address Register */
    Ifx_CPU_SPR_SPROT_RGN_UA UA;            /**< \brief 4, CPU Safety protection SPR Region Upper Address Register */
    Ifx_CPU_SPR_SPROT_RGN_ACCENA_W ACCENA_W;    /**< \brief 8, CPU Safety Protection Region SPR Write Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGN_ACCENB_W ACCENB_W;    /**< \brief C, CPU Safety Protection Region SPR Write Access Enable Register B */
} Ifx_CPU_SPR_SPROT_RGN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Protection range */
typedef volatile struct _Ifx_CPU_CPR
{
    Ifx_CPU_CPR_L L;                        /**< \brief 0, CPU Code Protection Range Lower Bound Register */
    Ifx_CPU_CPR_U U;                        /**< \brief 4, CPU Code Protection Range Upper Bound Register */
} Ifx_CPU_CPR;

/** \brief  Safety protection region */
typedef volatile struct _Ifx_CPU_DLMU_SPROT
{
    Ifx_CPU_DLMU_SPROT_RGN RGN[8];          /**< \brief 0, Safety protection region */
    unsigned char reserved_80[8];           /**< \brief 80, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA0_R RGNACCENA0_R;   /**< \brief 88, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB0_R RGNACCENB0_R;   /**< \brief 8C, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_90[8];           /**< \brief 90, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA1_R RGNACCENA1_R;   /**< \brief 98, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB1_R RGNACCENB1_R;   /**< \brief 9C, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_A0[8];           /**< \brief A0, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA2_R RGNACCENA2_R;   /**< \brief A8, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB2_R RGNACCENB2_R;   /**< \brief AC, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_B0[8];           /**< \brief B0, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA3_R RGNACCENA3_R;   /**< \brief B8, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB3_R RGNACCENB3_R;   /**< \brief BC, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_C0[8];           /**< \brief C0, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA4_R RGNACCENA4_R;   /**< \brief C8, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB4_R RGNACCENB4_R;   /**< \brief CC, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_D0[8];           /**< \brief D0, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA5_R RGNACCENA5_R;   /**< \brief D8, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB5_R RGNACCENB5_R;   /**< \brief DC, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_E0[8];           /**< \brief E0, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA6_R RGNACCENA6_R;   /**< \brief E8, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB6_R RGNACCENB6_R;   /**< \brief EC, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_F0[8];           /**< \brief F0, \internal Reserved */
    Ifx_CPU_DLMU_SPROT_RGNACCENA7_R RGNACCENA7_R;   /**< \brief F8, CPU Safety Protection Region DLMU Read Access Enable Register A */
    Ifx_CPU_DLMU_SPROT_RGNACCENB7_R RGNACCENB7_R;   /**< \brief FC, CPU Safety Protection Region DLMU Read Access Enable Register B */
    unsigned char reserved_100[11568];      /**< \brief 100, \internal Reserved */
} Ifx_CPU_DLMU_SPROT;

