Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
/** \brief  Protection range */
typedef volatile struct _Ifx_CPU_DPR
{
    Ifx_CPU_DPR_L L;                        /**< \brief 0, CPU Data Protection Range, Lower Bound Register */
    Ifx_CPU_DPR_U U;                        /**< \brief 4, CPU Data Protection Range, Upper Bound Register */
} Ifx_CPU_DPR;

/** \brief  Safety protection region */
typedef volatile struct _Ifx_CPU_SPR_SPROT
{
    Ifx_CPU_SPR_SPROT_RGN RGN[8];           /**< \brief 0, Safety protection region */
    unsigned char reserved_80[8];           /**< \brief 80, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA0_R RGNACCENA0_R;    /**< \brief 88, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB0_R RGNACCENB0_R;    /**< \brief 8C, CPU Safety Protection Region SPR Read Access Enable Register B */
    unsigned char reserved_90[8];           /**< \brief 90, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA1_R RGNACCENA1_R;    /**< \brief 98, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB1_R RGNACCENB1_R;    /**< \brief 9C, CPU Safety Protection Region SPR Read Access Enable Register B */
    unsigned char reserved_A0[8];           /**< \brief A0, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA2_R RGNACCENA2_R;    /**< \brief A8, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB2_R RGNACCENB2_R;    /**< \brief AC, CPU Safety Protection Region SPR Read Access Enable Register B */
    unsigned char reserved_B0[8];           /**< \brief B0, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA3_R RGNACCENA3_R;    /**< \brief B8, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB3_R RGNACCENB3_R;    /**< \brief BC, CPU Safety Protection Region SPR Read Access Enable Register B */
    unsigned char reserved_C0[8];           /**< \brief C0, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA4_R RGNACCENA4_R;    /**< \brief C8, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB4_R RGNACCENB4_R;    /**< \brief CC, CPU Safety Protection Region SPR Read Access Enable Register B */
    unsigned char reserved_D0[8];           /**< \brief D0, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA5_R RGNACCENA5_R;    /**< \brief D8, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB5_R RGNACCENB5_R;    /**< \brief DC, CPU Safety Protection Region SPR Read Access Enable Register B */
    unsigned char reserved_E0[8];           /**< \brief E0, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA6_R RGNACCENA6_R;    /**< \brief E8, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB6_R RGNACCENB6_R;    /**< \brief EC, CPU Safety Protection Region SPR Read Access Enable Register B */
    unsigned char reserved_F0[8];           /**< \brief F0, \internal Reserved */
    Ifx_CPU_SPR_SPROT_RGNACCENA7_R RGNACCENA7_R;    /**< \brief F8, CPU Safety Protection Region SPR Read Access Enable Register A */
    Ifx_CPU_SPR_SPROT_RGNACCENB7_R RGNACCENB7_R;    /**< \brief FC, CPU Safety Protection Region SPR Read Access Enable Register B */
} Ifx_CPU_SPR_SPROT;

/** \brief  Temporal Protection System */
typedef volatile struct _Ifx_CPU_TPS
{
    Ifx_CPU_TPS_CON CON;                    /**< \brief 0, CPU Temporal Protection System Control Register */
    Ifx_CPU_TPS_TIMER TIMER[3];             /**< \brief 4, CPU Temporal Protection System Timer Register */
} Ifx_CPU_TPS;

/** \brief  Trigger */
typedef volatile struct _Ifx_CPU_TR
{
    Ifx_CPU_TR_EVT EVT;                     /**< \brief 0, CPU Trigger Event  */
    Ifx_CPU_TR_ADR ADR;                     /**< \brief 4, CPU Trigger Address  */
} Ifx_CPU_TR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  CPU object */
typedef volatile struct _Ifx_CPU
{
    Ifx_CPU_OSEL OSEL;                      /**< \brief 0, CPU Overlay Range Select Register */
    unsigned char reserved_4[12];           /**< \brief 4, \internal Reserved */
    Ifx_CPU_RABR0 RABR0;                    /**< \brief 10, CPU Redirected Address Base Register 0 */
    Ifx_CPU_OTAR0 OTAR0;                    /**< \brief 14, CPU Overlay Target Address Register 0 */
    Ifx_CPU_OMASK0 OMASK0;                  /**< \brief 18, CPU Overlay Mask Register 0 */
    Ifx_CPU_RABR1 RABR1;                    /**< \brief 1C, CPU Redirected Address Base Register 1 */
    Ifx_CPU_OTAR1 OTAR1;                    /**< \brief 20, CPU Overlay Target Address Register 1 */
    Ifx_CPU_OMASK1 OMASK1;                  /**< \brief 24, CPU Overlay Mask Register 1 */
    Ifx_CPU_RABR2 RABR2;                    /**< \brief 28, CPU Redirected Address Base Register 2 */
    Ifx_CPU_OTAR2 OTAR2;                    /**< \brief 2C, CPU Overlay Target Address Register 2 */
    Ifx_CPU_OMASK2 OMASK2;                  /**< \brief 30, CPU Overlay Mask Register 2 */
    Ifx_CPU_RABR3 RABR3;                    /**< \brief 34, CPU Redirected Address Base Register 3 */
    Ifx_CPU_OTAR3 OTAR3;                    /**< \brief 38, CPU Overlay Target Address Register 3 */
    Ifx_CPU_OMASK3 OMASK3;                  /**< \brief 3C, CPU Overlay Mask Register 3 */
    Ifx_CPU_RABR4 RABR4;                    /**< \brief 40, CPU Redirected Address Base Register 4 */
    Ifx_CPU_OTAR4 OTAR4;                    /**< \brief 44, CPU Overlay Target Address Register 4 */
    Ifx_CPU_OMASK4 OMASK4;                  /**< \brief 48, CPU Overlay Mask Register 4 */
    Ifx_CPU_RABR5 RABR5;                    /**< \brief 4C, CPU Redirected Address Base Register 5 */
    Ifx_CPU_OTAR5 OTAR5;                    /**< \brief 50, CPU Overlay Target Address Register 5 */
    Ifx_CPU_OMASK5 OMASK5;                  /**< \brief 54, CPU Overlay Mask Register 5 */
    Ifx_CPU_RABR6 RABR6;                    /**< \brief 58, CPU Redirected Address Base Register 6 */
    Ifx_CPU_OTAR6 OTAR6;                    /**< \brief 5C, CPU Overlay Target Address Register 6 */
    Ifx_CPU_OMASK6 OMASK6;                  /**< \brief 60, CPU Overlay Mask Register 6 */
    Ifx_CPU_RABR7 RABR7;                    /**< \brief 64, CPU Redirected Address Base Register 7 */
    Ifx_CPU_OTAR7 OTAR7;                    /**< \brief 68, CPU Overlay Target Address Register 7 */
    Ifx_CPU_OMASK7 OMASK7;                  /**< \brief 6C, CPU Overlay Mask Register 7 */
    Ifx_CPU_RABR8 RABR8;                    /**< \brief 70, CPU Redirected Address Base Register 8 */
    Ifx_CPU_OTAR8 OTAR8;                    /**< \brief 74, CPU Overlay Target Address Register 8 */
    Ifx_CPU_OMASK8 OMASK8;                  /**< \brief 78, CPU Overlay Mask Register 8 */
    Ifx_CPU_RABR9 RABR9;                    /**< \brief 7C, CPU Redirected Address Base Register 9 */
    Ifx_CPU_OTAR9 OTAR9;                    /**< \brief 80, CPU Overlay Target Address Register 9 */
    Ifx_CPU_OMASK9 OMASK9;                  /**< \brief 84, CPU Overlay Mask Register 9 */
    Ifx_CPU_RABR10 RABR10;                  /**< \brief 88, CPU Redirected Address Base Register 10 */
    Ifx_CPU_OTAR10 OTAR10;                  /**< \brief 8C, CPU Overlay Target Address Register 10 */
    Ifx_CPU_OMASK10 OMASK10;                /**< \brief 90, CPU Overlay Mask Register 10 */
    Ifx_CPU_RABR11 RABR11;                  /**< \brief 94, CPU Redirected Address Base Register 11 */
    Ifx_CPU_OTAR11 OTAR11;                  /**< \brief 98, CPU Overlay Target Address Register 11 */
    Ifx_CPU_OMASK11 OMASK11;                /**< \brief 9C, CPU Overlay Mask Register 11 */
    Ifx_CPU_RABR12 RABR12;                  /**< \brief A0, CPU Redirected Address Base Register 12 */
    Ifx_CPU_OTAR12 OTAR12;                  /**< \brief A4, CPU Overlay Target Address Register 12 */
    Ifx_CPU_OMASK12 OMASK12;                /**< \brief A8, CPU Overlay Mask Register 12 */
    Ifx_CPU_RABR13 RABR13;                  /**< \brief AC, CPU Redirected Address Base Register 13 */
    Ifx_CPU_OTAR13 OTAR13;                  /**< \brief B0, CPU Overlay Target Address Register 13 */
    Ifx_CPU_OMASK13 OMASK13;                /**< \brief B4, CPU Overlay Mask Register 13 */
    Ifx_CPU_RABR14 RABR14;                  /**< \brief B8, CPU Redirected Address Base Register 14 */
    Ifx_CPU_OTAR14 OTAR14;                  /**< \brief BC, CPU Overlay Target Address Register 14 */
    Ifx_CPU_OMASK14 OMASK14;                /**< \brief C0, CPU Overlay Mask Register 14 */
    Ifx_CPU_RABR15 RABR15;                  /**< \brief C4, CPU Redirected Address Base Register 15 */
    Ifx_CPU_OTAR15 OTAR15;                  /**< \brief C8, CPU Overlay Target Address Register 15 */
    Ifx_CPU_OMASK15 OMASK15;                /**< \brief CC, CPU Overlay Mask Register 15 */
    Ifx_CPU_RABR16 RABR16;                  /**< \brief D0, CPU Redirected Address Base Register 16 */
    Ifx_CPU_OTAR16 OTAR16;                  /**< \brief D4, CPU Overlay Target Address Register 16 */
    Ifx_CPU_OMASK16 OMASK16;                /**< \brief D8, CPU Overlay Mask Register 16 */
    Ifx_CPU_RABR17 RABR17;                  /**< \brief DC, CPU Redirected Address Base Register 17 */
    Ifx_CPU_OTAR17 OTAR17;                  /**< \brief E0, CPU Overlay Target Address Register 17 */
    Ifx_CPU_OMASK17 OMASK17;                /**< \brief E4, CPU Overlay Mask Register 17 */
    Ifx_CPU_RABR18 RABR18;                  /**< \brief E8, CPU Redirected Address Base Register 18 */
    Ifx_CPU_OTAR18 OTAR18;                  /**< \brief EC, CPU Overlay Target Address Register 18 */
    Ifx_CPU_OMASK18 OMASK18;                /**< \brief F0, CPU Overlay Mask Register 18 */
    Ifx_CPU_RABR19 RABR19;                  /**< \brief F4, CPU Redirected Address Base Register 19 */
    Ifx_CPU_OTAR19 OTAR19;                  /**< \brief F8, CPU Overlay Target Address Register 19 */
    Ifx_CPU_OMASK19 OMASK19;                /**< \brief FC, CPU Overlay Mask Register 19 */
    Ifx_CPU_RABR20 RABR20;                  /**< \brief 100, CPU Redirected Address Base Register 20 */
    Ifx_CPU_OTAR20 OTAR20;                  /**< \brief 104, CPU Overlay Target Address Register 20 */
    Ifx_CPU_OMASK20 OMASK20;                /**< \brief 108, CPU Overlay Mask Register 20 */
    Ifx_CPU_RABR21 RABR21;                  /**< \brief 10C, CPU Redirected Address Base Register 21 */
    Ifx_CPU_OTAR21 OTAR21;                  /**< \brief 110, CPU Overlay Target Address Register 21 */
    Ifx_CPU_OMASK21 OMASK21;                /**< \brief 114, CPU Overlay Mask Register 21 */
    Ifx_CPU_RABR22 RABR22;                  /**< \brief 118, CPU Redirected Address Base Register 22 */
    Ifx_CPU_OTAR22 OTAR22;                  /**< \brief 11C, CPU Overlay Target Address Register 22 */
    Ifx_CPU_OMASK22 OMASK22;                /**< \brief 120, CPU Overlay Mask Register 22 */
    Ifx_CPU_RABR23 RABR23;                  /**< \brief 124, CPU Redirected Address Base Register 23 */
    Ifx_CPU_OTAR23 OTAR23;                  /**< \brief 128, CPU Overlay Target Address Register 23 */
    Ifx_CPU_OMASK23 OMASK23;                /**< \brief 12C, CPU Overlay Mask Register 23 */
    Ifx_CPU_RABR24 RABR24;                  /**< \brief 130, CPU Redirected Address Base Register 24 */
    Ifx_CPU_OTAR24 OTAR24;                  /**< \brief 134, CPU Overlay Target Address Register 24 */
    Ifx_CPU_OMASK24 OMASK24;                /**< \brief 138, CPU Overlay Mask Register 24 */
    Ifx_CPU_RABR25 RABR25;                  /**< \brief 13C, CPU Redirected Address Base Register 25 */
    Ifx_CPU_OTAR25 OTAR25;                  /**< \brief 140, CPU Overlay Target Address Register 25 */
    Ifx_CPU_OMASK25 OMASK25;                /**< \brief 144, CPU Overlay Mask Register 25 */
    Ifx_CPU_RABR26 RABR26;                  /**< \brief 148, CPU Redirected Address Base Register 26 */
    Ifx_CPU_OTAR26 OTAR26;                  /**< \brief 14C, CPU Overlay Target Address Register 26 */
    Ifx_CPU_OMASK26 OMASK26;                /**< \brief 150, CPU Overlay Mask Register 26 */
    Ifx_CPU_RABR27 RABR27;                  /**< \brief 154, CPU Redirected Address Base Register 27 */
    Ifx_CPU_OTAR27 OTAR27;                  /**< \brief 158, CPU Overlay Target Address Register 27 */
    Ifx_CPU_OMASK27 OMASK27;                /**< \brief 15C, CPU Overlay Mask Register 27 */
    Ifx_CPU_RABR28 RABR28;                  /**< \brief 160, CPU Redirected Address Base Register 28 */
    Ifx_CPU_OTAR28 OTAR28;                  /**< \brief 164, CPU Overlay Target Address Register 28 */
    Ifx_CPU_OMASK28 OMASK28;                /**< \brief 168, CPU Overlay Mask Register 28 */
    Ifx_CPU_RABR29 RABR29;                  /**< \brief 16C, CPU Redirected Address Base Register 29 */
    Ifx_CPU_OTAR29 OTAR29;                  /**< \brief 170, CPU Overlay Target Address Register 29 */
    Ifx_CPU_OMASK29 OMASK29;                /**< \brief 174, CPU Overlay Mask Register 29 */
    Ifx_CPU_RABR30 RABR30;                  /**< \brief 178, CPU Redirected Address Base Register 30 */
    Ifx_CPU_OTAR30 OTAR30;                  /**< \brief 17C, CPU Overlay Target Address Register 30 */
    Ifx_CPU_OMASK30 OMASK30;                /**< \brief 180, CPU Overlay Mask Register 30 */
    Ifx_CPU_RABR31 RABR31;                  /**< \brief 184, CPU Redirected Address Base Register 31 */
    Ifx_CPU_OTAR31 OTAR31;                  /**< \brief 188, CPU Overlay Target Address Register 31 */
    Ifx_CPU_OMASK31 OMASK31;                /**< \brief 18C, CPU Overlay Mask Register 31 */
    unsigned char reserved_190[3952];       /**< \brief 190, \internal Reserved */
    Ifx_CPU_FLASHCON0 FLASHCON0;            /**< \brief 1100, CPU Flash Configuration Register 0 */
    Ifx_CPU_FLASHCON1 FLASHCON1;            /**< \brief 1104, CPU Flash Configuration Register 1 */
    Ifx_CPU_FLASHCON2 FLASHCON2;            /**< \brief 1108, CPU Flash Configuration Register 2 */
    Ifx_CPU_FLASHCON3 FLASHCON3;            /**< \brief 110C, CPU Flash Configuration Register 3 */
    unsigned char reserved_1110[48880];     /**< \brief 1110, \internal Reserved */
    Ifx_CPU_KRST0 KRST0;                    /**< \brief D000, CPU Reset Register 0 */
    Ifx_CPU_KRST1 KRST1;                    /**< \brief D004, CPU Reset Register 1 */
    Ifx_CPU_KRSTCLR KRSTCLR;                /**< \brief D008, CPU Reset Status Clear Register */
    unsigned char reserved_D00C[4084];      /**< \brief D00C, \internal Reserved */
    Ifx_CPU_SPR_SPROT SPR_SPROT;            /**< \brief E000, Safety protection region */
    Ifx_CPU_SFR_SPROT_ACCENA_W SFR_SPROT_ACCENA_W;  /**< \brief E100, CPU Safety Protection Register Access Enable Register A */
    Ifx_CPU_SFR_SPROT_ACCENB_W SFR_SPROT_ACCENB_W;  /**< \brief E104, CPU Safety Protection Region Access Enable Register B */
    unsigned char reserved_E108[8];         /**< \brief E108, \internal Reserved */
    Ifx_CPU_LPB_SPROT_ACCENA_R LPB_SPROT_ACCENA_R;  /**< \brief E110, CPU Safety Protection Region LPB Read Access Enable Register A */
    Ifx_CPU_LPB_SPROT_ACCENB_R LPB_SPROT_ACCENB_R;  /**< \brief E114, CPU Safety Protection Region LPB Read Access Enable Register B */
    unsigned char reserved_E118[232];       /**< \brief E118, \internal Reserved */
    Ifx_CPU_DLMU_SPROT DLMU_SPROT;          /**< \brief E200, Safety protection region */
    Ifx_CPU_SEGEN SEGEN;                    /**< \brief 11030, CPU SRI Error Generation Register */
    unsigned char reserved_11034[28624];    /**< \brief 11034, \internal Reserved */
    Ifx_CPU_TASK_ASI TASK_ASI;              /**< \brief 18004, CPU Task Address Space Identifier Register */
    unsigned char reserved_18008[248];      /**< \brief 18008, \internal Reserved */
    Ifx_CPU_PMA0 PMA0;                      /**< \brief 18100, CPU Data Access CacheabilityRegister */
    Ifx_CPU_PMA1 PMA1;                      /**< \brief 18104, CPU Code Access CacheabilityRegister */
    Ifx_CPU_PMA2 PMA2;                      /**< \brief 18108, CPU Peripheral Space Identifier register */
    unsigned char reserved_1810C[3828];     /**< \brief 1810C, \internal Reserved */
    Ifx_CPU_DCON2 DCON2;                    /**< \brief 19000, CPU Data Control Register 2 */
    unsigned char reserved_19004[8];        /**< \brief 19004, \internal Reserved */
    Ifx_CPU_SMACON SMACON;                  /**< \brief 1900C, CPU SIST Mode Access Control Register */
    Ifx_CPU_DSTR DSTR;                      /**< \brief 19010, CPU Data Synchronous Trap Register */
    unsigned char reserved_19014[4];        /**< \brief 19014, \internal Reserved */
    Ifx_CPU_DATR DATR;                      /**< \brief 19018, CPU Data Asynchronous Trap Register */
    Ifx_CPU_DEADD DEADD;                    /**< \brief 1901C, CPU Data Error Address Register */
    Ifx_CPU_DIEAR DIEAR;                    /**< \brief 19020, CPU Data Integrity Error Address Register */
    Ifx_CPU_DIETR DIETR;                    /**< \brief 19024, CPU Data Integrity Error Trap Register */
    unsigned char reserved_19028[24];       /**< \brief 19028, \internal Reserved */
    Ifx_CPU_DCON0 DCON0;                    /**< \brief 19040, CPU Data Memory Control Register */
    unsigned char reserved_19044[444];      /**< \brief 19044, \internal Reserved */
    Ifx_CPU_PSTR PSTR;                      /**< \brief 19200, CPU Program Synchronous Trap Register */
    Ifx_CPU_PCON1 PCON1;                    /**< \brief 19204, CPU Program Control 1 */
    Ifx_CPU_PCON2 PCON2;                    /**< \brief 19208, CPU Program Control 2 */
    Ifx_CPU_PCON0 PCON0;                    /**< \brief 1920C, CPU Program Control 0 */
    Ifx_CPU_PIEAR PIEAR;                    /**< \brief 19210, CPU Program Integrity Error Address Register */
    Ifx_CPU_PIETR PIETR;                    /**< \brief 19214, CPU Program Integrity Error Trap Register */
    unsigned char reserved_19218[488];      /**< \brief 19218, \internal Reserved */
    Ifx_CPU_COMPAT COMPAT;                  /**< \brief 19400, CPU Compatibility Control Register */
    unsigned char reserved_19404[3068];     /**< \brief 19404, \internal Reserved */
    Ifx_CPU_FPU_TRAP_CON FPU_TRAP_CON;      /**< \brief 1A000, CPU Trap Control Register */
    Ifx_CPU_FPU_TRAP_PC FPU_TRAP_PC;        /**< \brief 1A004, CPU Trapping Instruction Program Counter Register */
    Ifx_CPU_FPU_TRAP_OPC FPU_TRAP_OPC;      /**< \brief 1A008, CPU Trapping Instruction Opcode Register */
    unsigned char reserved_1A00C[4];        /**< \brief 1A00C, \internal Reserved */
    Ifx_CPU_FPU_TRAP_SRC1 FPU_TRAP_SRC1;    /**< \brief 1A010, CPU Trapping Instruction Operand Register */
    Ifx_CPU_FPU_TRAP_SRC2 FPU_TRAP_SRC2;    /**< \brief 1A014, CPU Trapping Instruction Operand Register */
    Ifx_CPU_FPU_TRAP_SRC3 FPU_TRAP_SRC3;    /**< \brief 1A018, CPU Trapping Instruction Operand Register */
    unsigned char reserved_1A01C[8164];     /**< \brief 1A01C, \internal Reserved */
    Ifx_CPU_DPR DPR[18];                    /**< \brief 1C000, Protection range */
    unsigned char reserved_1C090[3952];     /**< \brief 1C090, \internal Reserved */
    Ifx_CPU_CPR CPR[10];                    /**< \brief 1D000, Protection range */
    unsigned char reserved_1D050[4016];     /**< \brief 1D050, \internal Reserved */
    Ifx_CPU_CPXE_0 CPXE_0;                  /**< \brief 1E000, CPU Code Protection Execute Enable Register Set 0 */
    Ifx_CPU_CPXE_1 CPXE_1;                  /**< \brief 1E004, CPU Code Protection Execute Enable Register Set 1 */
    Ifx_CPU_CPXE_2 CPXE_2;                  /**< \brief 1E008, CPU Code Protection Execute Enable Register Set 2 */
    Ifx_CPU_CPXE_3 CPXE_3;                  /**< \brief 1E00C, CPU Code Protection Execute Enable Register Set 3 */
    Ifx_CPU_DPRE_0 DPRE_0;                  /**< \brief 1E010, CPU Data Protection Read Enable Register Set 0 */
    Ifx_CPU_DPRE_1 DPRE_1;                  /**< \brief 1E014, CPU Data Protection Read Enable Register Set 1 */
    Ifx_CPU_DPRE_2 DPRE_2;                  /**< \brief 1E018, CPU Data Protection Read Enable Register Set 2 */
    Ifx_CPU_DPRE_3 DPRE_3;                  /**< \brief 1E01C, CPU Data Protection Read Enable Register Set 3 */
    Ifx_CPU_DPWE_0 DPWE_0;                  /**< \brief 1E020, CPU Data Protection Write Enable Register Set 0 */
    Ifx_CPU_DPWE_1 DPWE_1;                  /**< \brief 1E024, CPU Data Protection Write Enable Register Set 1 */
    Ifx_CPU_DPWE_2 DPWE_2;                  /**< \brief 1E028, CPU Data Protection Write Enable Register Set 2 */
    Ifx_CPU_DPWE_3 DPWE_3;                  /**< \brief 1E02C, CPU Data Protection Write Enable Register Set 3 */
    unsigned char reserved_1E030[32];       /**< \brief 1E030, \internal Reserved */
    Ifx_CPU_CPXE_4 CPXE_4;                  /**< \brief 1E050, CPU Code Protection Execute Enable Register Set 4 */
    Ifx_CPU_CPXE_5 CPXE_5;                  /**< \brief 1E054, CPU Code Protection Execute Enable Register Set 5 */
    unsigned char reserved_1E058[8];        /**< \brief 1E058, \internal Reserved */
    Ifx_CPU_DPRE_4 DPRE_4;                  /**< \brief 1E060, CPU Data Protection Read Enable Register Set 4 */
    Ifx_CPU_DPRE_5 DPRE_5;                  /**< \brief 1E064, CPU Data Protection Read Enable Register Set 5 */
    unsigned char reserved_1E068[8];        /**< \brief 1E068, \internal Reserved */
    Ifx_CPU_DPWE_4 DPWE_4;                  /**< \brief 1E070, CPU Data Protection Write Enable Register Set 4 */
    Ifx_CPU_DPWE_5 DPWE_5;                  /**< \brief 1E074, CPU Data Protection Write Enable Register Set 5 */
    unsigned char reserved_1E078[904];      /**< \brief 1E078, \internal Reserved */
    Ifx_CPU_TPS TPS;                        /**< \brief 1E400, Temporal Protection System */
    unsigned char reserved_1E410[48];       /**< \brief 1E410, \internal Reserved */
    Ifx_CPU_TPS_EXTIM_LVAL TPS_EXTIM_LVAL;  /**< \brief 1E440, CPU Exception Timer Load Value */
    Ifx_CPU_TPS_EXTIM_CVAL TPS_EXTIM_CVAL;  /**< \brief 1E444, CPU Exception Timer Current Value */
    Ifx_CPU_TPS_EXTIM_CLASS_EN TPS_EXTIM_CLASS_EN;  /**< \brief 1E448, CPU Exception Timer Class Enable Register */
    Ifx_CPU_TPS_EXTIM_STAT TPS_EXTIM_STAT;  /**< \brief 1E44C, CPU Exception Timer Status Register */
    Ifx_CPU_TPS_EXTIM_FCX TPS_EXTIM_FCX;    /**< \brief 1E450, CPU Exception Timer Status Register */
    unsigned char reserved_1E454[2988];     /**< \brief 1E454, \internal Reserved */
    Ifx_CPU_TR TR[8];                       /**< \brief 1F000, Trigger */
    unsigned char reserved_1F040[3008];     /**< \brief 1F040, \internal Reserved */
    Ifx_CPU_CCTRL CCTRL;                    /**< \brief 1FC00, CPU Counter Control */
    Ifx_CPU_CCNT CCNT;                      /**< \brief 1FC04, CPU CPU Clock Cycle Count */
    Ifx_CPU_ICNT ICNT;                      /**< \brief 1FC08, CPU Instruction Count */
    Ifx_CPU_M1CNT M1CNT;                    /**< \brief 1FC0C, CPU Multi-Count Register 1 */
    Ifx_CPU_M2CNT M2CNT;                    /**< \brief 1FC10, CPU Multi-Count Register 2 */
    Ifx_CPU_M3CNT M3CNT;                    /**< \brief 1FC14, CPU Multi-Count Register 3 */
    unsigned char reserved_1FC18[232];      /**< \brief 1FC18, \internal Reserved */
    Ifx_CPU_DBGSR DBGSR;                    /**< \brief 1FD00, CPU Debug Status Register */
    unsigned char reserved_1FD04[4];        /**< \brief 1FD04, \internal Reserved */
    Ifx_CPU_EXEVT EXEVT;                    /**< \brief 1FD08, CPU External Event Register */
