Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_regdef.h
    Ifx_CPU_CREVT CREVT;                    /**< \brief 1FD0C, CPU Core Register Access Event */
    Ifx_CPU_SWEVT SWEVT;                    /**< \brief 1FD10, CPU Software Debug Event */
    unsigned char reserved_1FD14[28];       /**< \brief 1FD14, \internal Reserved */
    Ifx_CPU_TRIG_ACC TRIG_ACC;              /**< \brief 1FD30, CPU Trigger Address x */
    unsigned char reserved_1FD34[12];       /**< \brief 1FD34, \internal Reserved */
    Ifx_CPU_DMS DMS;                        /**< \brief 1FD40, CPU Debug Monitor Start Address */
    Ifx_CPU_DCX DCX;                        /**< \brief 1FD44, CPU Debug Context Save Area Pointer */
    Ifx_CPU_DBGTCR DBGTCR;                  /**< \brief 1FD48, CPU Debug Trap Control Register */
    unsigned char reserved_1FD4C[180];      /**< \brief 1FD4C, \internal Reserved */
    Ifx_CPU_PCXI PCXI;                      /**< \brief 1FE00, CPU Previous Context Information Register */
    Ifx_CPU_PSW PSW;                        /**< \brief 1FE04, CPU Program Status Word */
    Ifx_CPU_PC PC;                          /**< \brief 1FE08, CPU Program Counter */
    unsigned char reserved_1FE0C[8];        /**< \brief 1FE0C, \internal Reserved */
    Ifx_CPU_SYSCON SYSCON;                  /**< \brief 1FE14, CPU System Configuration Register */
    Ifx_CPU_CPU_ID CPU_ID;                  /**< \brief 1FE18, CPU Identification Register TC1.6P */
    Ifx_CPU_CORE_ID CORE_ID;                /**< \brief 1FE1C, CPU Core Identification Register */
    Ifx_CPU_BIV BIV;                        /**< \brief 1FE20, CPU Base Interrupt Vector Table Pointer */
    Ifx_CPU_BTV BTV;                        /**< \brief 1FE24, CPU Base Trap Vector Table Pointer */
    Ifx_CPU_ISP ISP;                        /**< \brief 1FE28, CPU Interrupt Stack Pointer */
    Ifx_CPU_ICR ICR;                        /**< \brief 1FE2C, CPU Interrupt Control Register */
    unsigned char reserved_1FE30[8];        /**< \brief 1FE30, \internal Reserved */
    Ifx_CPU_FCX FCX;                        /**< \brief 1FE38, CPU Free CSA List Head Pointer */
    Ifx_CPU_LCX LCX;                        /**< \brief 1FE3C, CPU Free CSA List Limit Pointer */
    unsigned char reserved_1FE40[16];       /**< \brief 1FE40, \internal Reserved */
    Ifx_CPU_CUS_ID CUS_ID;                  /**< \brief 1FE50, CPU Customer ID register */
    unsigned char reserved_1FE54[172];      /**< \brief 1FE54, \internal Reserved */
    Ifx_CPU_D D[16];                        /**< \brief 1FF00, CPU Data General Purpose Register */
    unsigned char reserved_1FF40[64];       /**< \brief 1FF40, \internal Reserved */
    Ifx_CPU_A A[16];                        /**< \brief 1FF80, CPU Address General Purpose Register */
    unsigned char reserved_1FFC0[64];       /**< \brief 1FFC0, \internal Reserved */
} Ifx_CPU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCPU_REGDEF_H */
